In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")

In [4]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
Sex_counts = df['Sex'].value_counts()

In [7]:
print(Sex_counts)

male      577
female    314
Name: Sex, dtype: int64

In [8]:
row_index = 5

In [9]:
specific_row = df.iloc[row_index]

In [10]:
print(specific_row)

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [11]:
df.at[5, 'Age'] = 28

In [12]:
adults = df[df['Age'] > 18]

In [13]:
number_of_adults = len(adults)

In [14]:
print(f'There are {number_of_adults} people over the age of 18.')

There are 576 people over the age of 18.

In [15]:
print((df[df['Sex'] == 'male'].shape[0]/len(df))*100)

64.75869809203144

In [16]:
pclass_frequencies = df['Pclass'].value_counts()
print(pclass_frequencies)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
class_counts = df['Pclass'].value_counts(normalize=True)
relative_frequencies = class_counts * 100

In [19]:
print(relative_frequencies)

3    55.106622
1    24.242424
2    20.650954
Name: Pclass, dtype: float64

In [21]:
df[df['PassengerId'] == 528]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
527,528,0,1,"Farthing, Mr. John",male,NaN,0,0,PC 17483,221.7792,C95,S